Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: There are 5 statically defined priorities and 128 cohorts, which amounts to 640 request groups in total.
ja_jp: 静的に定義された優先度が 5 つ、コホートが 128 あり、合計で 640 のリクエストグループになります。

source: There are Asciidoc content regions defined by tag pairs (`tag::` and `end::`) in comments surrounding different sections of code.
ja_jp: コードのさまざまなセクションを囲むコメントには、タグのペア (`tag::` および `end::`) によって定義された Asciidoc コンテンツリージョンがあります。

source: There are a few common approaches to make the best of it.
ja_jp: それを生かすためにはいくつかの共通したアプローチがあります。

source: There are a few differences/additions though. Let's check them out.
ja_jp: しかし、いくつかの違いや付加価値があります。それを見てみましょう。

source: There are a few goals we can invoke at this point, we can for example ask JReleaser to print out its current configuration by invoking the `./mvnw -Prelease jreleaser:config` command. The tool will output everything that it knows about the project. We can also generate the changelog by invoking `./mvnw -Prelease jreleaser:changelog`. A file containing the changelog will be placed at `target/jreleaser/release/CHANGELOG.md` which at this point should look like this:
ja_jp: この時点で呼び出すことができるいくつかの目標があります。たとえば、 `./mvnw -Prelease jreleaser:config` コマンドを呼び出すことにより、JReleaser に現在の設定を出力するように依頼できます。ツールは、プロジェクトについて知っているすべてのものを出力します。 `./mvnw -Prelease jreleaser:changelog` を呼び出して変更ログを生成することもできます。変更ログを含むファイルは `target/jreleaser/release/CHANGELOG.md` に配置され、この時点では次のようになります。

source: There are a few interesting parts in this listing:
ja_jp: このリストには興味深い点がいくつかあります。

source: There are a few modes in which the form data can be encoded. By default, REST Client uses RFC1738. You can override it by specifying the mode either on the client level, by setting `io.quarkus.rest.client.multipart-post-encoder-mode` RestBuilder property to the selected value of `HttpPostRequestEncoder.EncoderMode` or by specifying `quarkus.rest-client.multipart-post-encoder-mode` in your `application.properties`. Please note that the latter works only for clients created with the `@RegisterRestClient` annotation. All the available modes are described in the link:https://netty.io/4.1/api/io/netty/handler/codec/http/multipart/HttpPostRequestEncoder.EncoderMode.html[Netty documentation]
ja_jp: フォームデータのエンコードには、いくつかのモードがあります。デフォルトでは、 Rest Client は RFC1738 を使用します。 クライアントレベルで、 `io.quarkus.rest.client.multipart-post-encoder-mode` RestBuilder プロパティーを `HttpPostRequestEncoder.EncoderMode` の選択した値に設定するか、 `application.properties` で `quarkus.rest-client.multipart-post-encoder-mode` を指定して、 モードをオーバーライドできます。後者は `@RegisterRestClient` アノテーションで作成された クライアントに対してのみ機能することに注意してください。 利用可能なすべてのモードは、link:https://netty.io/4.1/api/io/netty/handler/codec/http/multipart/HttpPostRequestEncoder.EncoderMode.html[Netty ドキュメント] に記載されています。

source: There are a few modes in which the form data can be encoded. By default, Rest Client Reactive uses RFC1738. You can override it by specifying the mode either on the client level, by setting `io.quarkus.rest.client.multipart-post-encoder-mode` RestBuilder property to the selected value of `HttpPostRequestEncoder.EncoderMode` or by specifying `quarkus.rest-client.multipart-post-encoder-mode` in your `application.properties`. Please note that the latter works only for clients created with the `@RegisterRestClient` annotation. All the available modes are described in the link:https://netty.io/4.1/api/io/netty/handler/codec/http/multipart/HttpPostRequestEncoder.EncoderMode.html[Netty documentation]
ja_jp: フォームデータのエンコードには、いくつかのモードがあります。デフォルトでは、Rest Client Reactive は RFC1738 を使用します。クライアントレベルで、 `io.quarkus.rest.client.multipart-post-encoder-mode` RestBuilder プロパティーを `HttpPostRequestEncoder.EncoderMode` の選択した値に設定するか、 `application.properties` で `quarkus.rest-client.multipart-post-encoder-mode` を指定して、モードを上書きすることができます。後者は `@RegisterRestClient` アノテーションで作成されたクライアントに対してのみ機能することに注意してください。利用可能なすべてのモードは、link:https://netty.io/4.1/api/io/netty/handler/codec/http/multipart/HttpPostRequestEncoder.EncoderMode.html[Netty documentation] に記載されています。

source: There are a few more properties that we can configure to tune the service discovery:
ja_jp: サービスディスカバリーを調整するために、さらにいくつかのプロパティを設定することができます。

source: There are a few options to add full page content in Dev UI. Starting from the most basic (good start) to a full blown web-component (preferred).
ja_jp: Dev UI にページ全体のコンテンツを追加する方法としては、いくつかのオプションがあります。最も基本的なもの (入門向け) から本格的な Web コンポーネント (推奨) まであります。

source: There are a few parts to this process. Just remember that each step should conclude with a comprehensible/observable result: "The output should look something like this..."
ja_jp: このプロセスにはいくつかの部分があります。各手順は、理解可能/観察可能な結果 (「出力はこのようになります...」など) で終了する必要があることを覚えておいてください。

source: There are a few steps to get your Funqy function running on AWS Lambda. The quickstart maven project generates a helpful script to create, update, delete, and invoke your functions for pure Java and native deployments. This script is generated at build time.
ja_jp: Funqy 関数を AWS Lambda 上で動作させるには、いくつかのステップがあります。quickstart maven プロジェクトは、純粋な Java とネイティブデプロイメント用の関数を作成、更新、削除、呼び出すための便利なスクリプトを生成します。このスクリプトはビルド時に生成されます。

source: There are a few steps to get your lambda running on AWS. The generated maven project contains a helpful script to create, update, delete, and invoke your lambdas for pure Java and native deployments.
ja_jp: Lambda をAWS上で動作させるには、いくつかのステップがあります。生成されたmavenプロジェクトには、pure Java とネイティブデプロイメント用の Lambda を作成、更新、削除、呼び出しするための便利なスクリプトが含まれています。

source: There are a few things to notice in this code sample:
ja_jp: このコードサンプルには、注意すべき点がいくつかあります。

source: There are a few ways in which you can specify custom headers for your REST calls:
ja_jp: REST 呼び出しのカスタムヘッダーを指定する方法はいくつかあります。

source: There are a few ways to run the application locally depending on what your goals are. https://docs.docker.com/compose[Docker Compose^] can be used if you want to run the <<running-the-entire-application,entire application>>, or a <<running-a-subset-of-the-application,subset of it>>, using the https://quay.io/quarkus-super-heroes[pre-built container images^]. Alternatively, each application can be <<running-locally-via-quarkus-dev-mode,run from source>>.
ja_jp: アプリケーションをローカルで実行するには、目的に応じていくつかの方法があります。 link:https://docs.docker.com/compose[Docker Compose, window=_blank]は、 link:https://quay.io/quarkus-super-heroes[事前に構築されたコンテナイメージ, window=_blank]を使用して、 link:#running-the-entire-application[アプリケーション全体]または link:#running-a-subset-of-the-application[そのサブセット]を実行したい場合に使用できます。また、各アプリケーションを link:#running-locally-via-quarkus-dev-mode[ソースから実行]することもできます。

source: There are a lot of bundled analyzers but you can also develop your own for your own specific purposes.
ja_jp: バンドルされているアナライザーはたくさんありますが、自分の特定の目的に合わせて独自に開発することも可能です。

source: There are a lot of bundled analyzers, but you can also develop your own for your own specific purposes.
ja_jp: 多くのバンドルされたアナライザーがありますが、自分の目的に合わせて独自に開発することもできます。

source: There are a lot of different configuration options that can affect how the native executable is generated. These are provided in `application.properties` the same as any other config property.
ja_jp: ネイティブ実行可能ファイルの生成方法に影響を与える設定オプションがたくさんあります。これらは他の設定プロパティーと同じように `application.properties` で提供されています。

source: There are a lot of different ways to centralize your logs (if you are using Kubernetes, the simplest way is to log to the console and ask you cluster administrator to integrate a central log manager inside your cluster). In this guide, we will expose how to send them to an external tool using the `quarkus-logging-gelf` extension that can use TCP or UDP to send logs in the Graylog Extended Log Format (GELF).
ja_jp: ログを一元化する方法はたくさんあります(Kubernetesを使用している場合、最も簡単な方法はコンソールにログインして、クラスター管理者にクラスター内に一元化されたログマネージャーを統合するように依頼することです)。このガイドでは、TCPまたはUDPを使用してGraylog Extended Log Format (GELF)でログを送信できる `quarkus-logging-gelf` エクステンションを使用して外部ツールに送信する方法を公開します。

source: There are a lot of different ways to centralize your logs (if you are using Kubernetes, the simplest way is to log to the console and ask your cluster administrator to integrate a central log manager inside your cluster). In this guide, we will expose how to send them to an external tool using supported Quarkus extensions in supported standard formats like Graylog Extended Log Format (GELF), Elastic Common Schema (ECS) or the OpenTelemetry Log signal.
ja_jp: ログを一元化する方法はたくさんあります (Kubernetesを使用している場合、最も簡単な方法は、コンソールにログを記録し、一元的なログマネージャーをクラスター内に統合するようにクラスター管理者に依頼することです)。 このガイドでは、サポートされている Quarkus エクステンションを使用して、Graylog Extended Log Format (GELF)、Elastic Common Schema (ECS)、OpenTelemetry Log シグナルなどのサポートされている標準フォーマットで、ログを外部ツールに送信する方法について説明します。

source: There are a number of contextual objects that the framework will give you, if your endpoint method takes parameters of the following type:
ja_jp: エンドポイントメソッドが次のタイプのパラメーターを受け取る場合、フレームワークが提供するコンテキストオブジェクトは多数あります。

source: There are a several configuration options that will define what the output of your project build will be. These are provided in `application.properties` the same as any other config property.
ja_jp: プロジェクトのビルドの出力を定義するための設定オプションがいくつかあります。これらは他の設定プロパティーと同じように `application.properties` で提供されています。

source: There are advantages and disadvantages to indirectly enforcing the introspection of JWT tokens remotely. An advantage is that you eliminate the need for two remote calls: a remote OIDC metadata discovery call followed by another remote call to fetch the verification keys that will not be used. A disadvantage is that you need to know the introspection endpoint address and configure it manually.
ja_jp: JWT トークンのイントロスペクションをリモートで間接的に実施することには、利点と欠点があります。 利点は、2 つのリモート呼び出し (リモート OIDC メタデータ検出呼び出しと、それに続く使用されない検証キーを取得するための別のリモート呼び出し) が不要になることです。 欠点は、ユーザーがイントロスペクションエンドポイントアドレスを確認して、手動で設定する必要があることです。

source: There are also other convenient methods. For example, `OpenClientConnections#findByClientId(String)` makes it easy to find connections for a specific endpoint.
ja_jp: 他にも便利な方法があります。 たとえば、 `OpenClientConnections#findByClientId(String)` を使用すると、特定のエンドポイントの接続を簡単に見つけることができます。

source: There are also other convenient methods. For example, `OpenConnections#findByEndpointId(String)` makes it easy to find connections for a specific endpoint.
ja_jp: 他にも便利な方法があります。 たとえば、 `OpenConnections#findByEndpointId(String)` を使用すると、特定のエンドポイントの接続を簡単に見つけることができます。

source: There are also three system properties that allow you to dump the generated/transformed classes to the filesystem and inspect them later, for example via a decompiler in your IDE.
ja_jp: また、生成/変換されたクラスをファイルシステムにダンプして、IDEのデコンパイラなどで後から検査することができる3つのシステム・プロパティがあります。

source: There are also two methods that return https://smallrye.io/smallrye-mutiny/[Mutiny] types. `TemplateInstance.createUni()` returns a new `Uni<String>` object. If you call `createUni()` the template is not rendered right away. Instead, every time `Uni.subscribe()` is called a new rendering of the template is triggered.
ja_jp: また、https://smallrye.io/smallrye-mutiny/[Mutiny] タイプを返す 2 つのメソッドがあります。 `TemplateInstance.createUni()` は新しい `Uni<String>` オブジェクトを返します。 `createUni()` を呼び出しても、テンプレートはすぐにレンダリングされません。 その代わり、`Uni.subscribe()` が呼び出されるたびに、テンプレートの新しいレンダリングがトリガーされます。

source: There are always new users trying to get started quickly. Share your experience with everyone by writing a Quickstart and submitting it for peer review.
ja_jp: すぐ入門したい新しいユーザーは常に存在します。 クイックスタートを執筆し、ピアレビューに送信して、あなたの経験を皆に共有して下さい。

source: There are callouts as comments on some lines, and their numbering is not sequential.
ja_jp: 一部の行にコメントとしてコールアウトがあり、それらの番号は連続していません。

source: There are cases when additional files (other than ones produced by the Quarkus build) need to be added to a container image. To support these cases, Quarkus copies any file under `src/main/jib` into the built container image (which is essentially the same idea that the Jib Maven and Gradle plugins support). For example, the presence of `src/main/jib/foo/bar` would result in `/foo/bar` being added into the container filesystem.
ja_jp: コンテナーイメージに追加のファイル(Quarkus のビルドで作成されたもの以外)を追加する必要がある場合があります。このような場合に対応するため、Quarkus は、 `src/main/jib` 以下のファイルをすべてビルドされたコンテナーイメージにコピーします (これは、Jib Maven や Gradle プラグインがサポートしているのと基本的に同じ考え方です)。例えば、 `src/main/jib/foo/bar` が存在すると、 `/foo/bar` がコンテナファイルシステムに追加されます。

source: There are cases where an extension needs some of its build steps to run regardless of whether another part of the build process consumes any of its output (if such output even exists). One could argue that maybe such functionality shouldn't be put in a separate build step, but rather be part of another. However, it might make sense to run independent processing in separate build steps so that they can execute concurrently of other build tasks.
ja_jp: エクステンションは、ビルドプロセスの他の部分がその出力（出力が存在する場合）を消費するかどうかにかかわらず、一部のビルドステップを実行する必要がある場合があります。このような機能は独立したビルドステップに配置すべきではなく、むしろ別のステップの一部であるべきだと主張することもできます。しかし、他のビルドタスクと並行して実行できるように、独立した処理を別々のビルドステップで実行することには意味があるかもしれません。

source: There are cases where the built container image may need to have Java debugging conditionally enabled at runtime.
ja_jp: ビルドしたコンテナイメージでは、実行時に条件付きでJavaデバッグを有効にする必要がある場合があります。

source: There are cases where the initialization of certain classes is done in a static block needs to be postponed to runtime. Typically omitting such configuration would result in a runtime exception like the following:
ja_jp: 特定のクラスの初期化が静的ブロックで行われる場合、実行時に延期する必要がある場合があります。通常、このような設定を省略すると、以下のような実行時例外が発生します。

source: There are cases where the initialization of certain classes is done in a static block needs to be postponed to runtime. Typically, omitting such configuration would result in a runtime exception like the following:
ja_jp: 特定のクラスの初期化が静的ブロックで行われる場合、実行時に延期する必要がある場合があります。通常、このような設定を省略すると、以下のような実行時例外が発生します。

source: There are convenience redirects in this case as `quarkus.http.non-application-root-path` is not the same as `quarkus.http.root-path`. In this configuration, `/metrics` will be redirected to `/q/metrics`.
ja_jp: この場合、 `quarkus.http.non-application-root-path` と `quarkus.http.root-path` は同じではないので、利便性の為のリダイレクトがあります。この設定では、 `/metrics` は `/q/metrics` にリダイレクトされます。

source: There are convenience redirects in this case, too, as `quarkus.http.non-application-root-path` is not the same as `quarkus.http.root-path`. In this configuration, `/root/metrics` will be redirected to `/root/q/metrics`. This is consistent with previous behavior, where non-application endpoints were implicitly relative to the HTTP root path.
ja_jp: この場合も、 `quarkus.http.non-application-root-path` と `quarkus.http.root-path`.は同じではないので、便利なリダイレクトがあります。この設定では、 `/root/metrics` は `/root/q/metrics` にリダイレクトされます。これは、アプリケーション以外のエンドポイントが暗黙のうちに HTTP ルートパスから相対化されていた以前の動作と一致しています。

source: There are different approaches for using ACI. Check the documentation for details. The quickest way to get a container up and running goes as it follows.
ja_jp: ACIを使用するためには、さまざまなアプローチがあります。詳細はドキュメントを確認してください。コンテナーを起動して稼働させるための最も手っ取り早い方法は以下の通りです。

source: There are different query languages used in this API:
ja_jp: この API では、異なるクエリ言語が使用されています。

source: There are different scenarios which may require _repairing_ the Flyway schema history table. One such scenario is when a migration fails in a database which doesn't support transactional DDL statements.
ja_jp: Flyway スキーマ履歴テーブルの _修復_ が必要となるシナリオはさまざまです。そのようなシナリオの1つは、トランザクションDDL文をサポートしていないデータベースで移行が失敗した場合です。

source: There are four Quarkus applications, each of which will be described further below, an http://angular.io/[Angular^] application, and some backing services: https://prometheus.io[Prometheus^], https://www.postgresql.org[PostgreSQL^], https://kafka.apache.org[Apache Kafka^], and https://www.apicur.io/registry[Apicurio Schema Registry^].
ja_jp: 4つのQuarkusアプリケーションがあり、それぞれについては後述しますが、 link:http://angular.io/[Angular, window=_blank]アプリケーションと、いくつかのバックエンドサービスがあります。 link:https://prometheus.io[Prometheus, window=_blank]、 link:https://www.postgresql.org[PostgreSQL, window=_blank]、 link:https://kafka.apache.org[Apache Kafka, window=_blank]、 link:https://www.apicur.io/registry[Apicurio Schema Registry, window=_blank]の4つです。

source: There are heaps of helpful <a href="{{site.baseurl}}/publications">articles and blog posts</a> out there presenting interesting use-cases and examples of Quarkus in action.
ja_jp: Quarkusの興味深いユースケースと実践例を示す、役立つ<a href="{{site.baseurl}}/publications">記事やブログ投稿</a>が沢山存在します。

source: There are many `BuildItem` implementations, each one represents an aspect of the deployment process. Here are some examples:
ja_jp: 多くの `BuildItem` 実装があり、それぞれが展開プロセスの一面を表しています。ここではいくつかの例を紹介します。

source: There are many ways to include source code and examples in documentation.
ja_jp: ドキュメントにソースコードやサンプルを含めるには、さまざまな方法があります。

source: There are many ways to include source code and examples in the documentation.
ja_jp: ドキュメントにソースコードや例を含める方法は多数あります。

source: There are more formatting options you may apply but for now these will suffice. Let's make yet another commit right now, with "build: Configure JReleaser plugin" as a commit message. If you want you can generate the changelog once again and see this latest commit added to the file.
ja_jp: 適用できるフォーマットオプションは他にもありますが、今のところはこれらで十分です。ビルド: JReleaser プラグインの設定をコミットメッセージとして使用して、今すぐさらに別のコミットを行いましょう。必要に応じて、変更ログをもう一度生成して、この最新のコミットがファイルに追加されていることを確認できます。

source: There are multiple configuration sources that influence Quarkus builds, mentioned in the order of their priority. The Quarkus build uses the `prod` configuration profile:
ja_jp: Quarkusのビルドに影響を与える設定ソースは複数あり、優先順位順に説明しています。Quarkusのビルドでは、 `prod` の設定プロファイルが使用されます:

source: There are multiple ways in which a native executable produced by Mandrel can be profiled. All the methods require you to pass in the `-H:-DeleteLocalSymbols` option.
ja_jp: Mandrelが作成したネイティブ実行可能ファイルをプロファイリングする方法は複数あります。すべての方法で、 `-H:-DeleteLocalSymbols` オプションを渡す必要があります。

source: There are multiple ways to output Micrometer metrics. Next there are some examples:
ja_jp: Micrometer メトリクスを出力する方法は複数あります。次にいくつか例を示します。

source: There are new methods to handle errors in OpenTelemetry.
ja_jp: OpenTelemetry でエラーを処理するための新しいメソッドがあります。

source: There are no convenience redirects in this scenario, as the non-application endpoint behavior has been disabled entirely.
ja_jp: このシナリオでは、アプリケーション以外のエンドポイントの動作が完全に無効化されているため、利便性のためのリダイレクトはありません。

source: There are no docs yet. Docs will be added before the formal 1.11 release and will be progressively enhanced. This email should contain all the information you need to get started, but should you run into any trouble, we are available to help on any of the usual channels (Zulip chat, mailing list, GitHub Issues, StackOverflow).
ja_jp: ドキュメントはまだありません。ドキュメントは正式な1.11リリースの前に追加され、徐々に強化されていく予定です。 このメールには開始に必要な情報がすべて含まれているはずですが、何か問題が発生した場合は、通常のチャネル(Zulip チャット、メーリングリスト、GitHub Issues、StackOverflow)のいずれかで支援を受けることができます。

source: There are no legumes there.
ja_jp: そこにはマメ科植物はありません。

source: There are no mandatory configurations for the extension to work.
ja_jp: エクステンションを動作させるために必須の設定はありません。

source: There are no required properties, as long as a default datasource is configured.
ja_jp: デフォルトのデータソースが設定されていれば、それ以外に必須のプロパティーはありません。

source: There are no required properties, as long as the Hibernate ORM extension is configured properly.
ja_jp: Hibernate ORMエクステンションが適切に設定されている限り、必須のプロパティーはありません。

source: There are often initialization tasks performed by Quarkus extensions that are meant to be run once. For example, Flyway or Liquibase initialization falls into that category. But what happens when the scaling needs of an application requires more instances of the application to run? Or what happens when the application restarts ?
ja_jp: Quarkusのエクステンションによって実行される初期化タスクには、一度だけ実行されるものがよくあります。 例えば、FlywayやLiquibaseの初期化などがそれに該当します。 しかし、アプリケーションのスケーリングニーズによって、より多くのインスタンスを実行する必要がある場合はどうなるでしょうか？ あるいは、アプリケーションが再起動した場合はどうなるでしょうか？

source: There are often initialization tasks performed by Quarkus extensions that are meant to be run once. For example, Flyway or Liquibase initialization falls into that category. But what happens when the scaling needs of an application requires more instances of the application to run? Or what happens when the application restarts?
ja_jp: Quarkusのエクステンションによって実行される初期化タスクには、一度だけ実行されるものがよくあります。 例えば、FlywayやLiquibaseの初期化などがそれに該当します。しかし、アプリケーションのスケーリングニーズによって、より多くのインスタンスを実行する必要がある場合はどうなるでしょうか？あるいは、アプリケーションが再起動した場合はどうなるでしょうか？

source: There are other build items specialized in transformation: <<additional_interceptor_bindings>> and <<injection_point_transformation>>.
ja_jp: 変換に特化した他のビルドアイテム (<<additional_interceptor_bindings>> および<<injection_point_transformation>>) もあります。

source: There are other methods that can be useful to manipulate counters, such as:
ja_jp: 他にも、カウンターを操作する際に便利なメソッドがあります。以下に例を示します。

source: There are several areas where we expect things to improve:
ja_jp: 改善が期待されるいくつかの領域があります。

source: There are several kinds of beans. The most common ones are class-based beans:
ja_jp: Beanにはいくつかの種類があります。一番多いのは、クラスベースのBeanです。

source: There are several other ways your application can consume incoming messages:
ja_jp: アプリケーションが受信したメッセージを消費する方法は、他にもいくつかあります。

source: There are several reasons for 3). The JVM does not have a closed world assumption. So, it has to be able to recompile code if loading of new classes implies that it needs to revise optimistic assumptions made at compile time. For example, if an interface has only one implementation it can make a call jump directly to that code. However, in the case where a second implementation class is loaded the call site needs to be patched to test the type of the receiver instance and jump to the code that belongs to its class. Supporting optimizations like this one requires keeping track of a lot more details of the class base than a native executable, including recording the full class and interface hierarchy, details of which methods override other methods, all method bytecode etc. In a native executable most of the details of class structure and bytecode can be ignored at run time.
ja_jp: 3)にはいくつかの理由があります。JVMは閉じた世界を想定していません。そのため、新しいクラスのロードにより、コンパイル時の楽観的な仮定を修正する必要がある場合には、コードを再コンパイルできなければなりません。例えば、あるインターフェイスの実装が1つだけの場合、そのコードに直接コールジャンプすることができます。しかし、2つ目の実装クラスがロードされた場合には、レシーバのインスタンスのタイプをテストして、そのクラスに属するコードにジャンプするようにコールサイトを修正する必要があります。このような最適化をサポートするには、ネイティブ実行可能ファイルよりもクラスベースの詳細を記録しておく必要があります。これには、完全なクラスとインターフェイスの階層、どのメソッドが他のメソッドをオーバーライドするかの詳細、すべてのメソッドのバイトコードなどが含まれます。ネイティブ実行可能ファイルでは、クラス構造やバイトコードの詳細のほとんどは実行時には無視できます。

source: There are several things of interest to notice there:
ja_jp: そこには、いくつかの気になる点があります:

source: There are several ways to register a <<cdi-integration.adoc#synthetic_beans,synthetic bean>> in Quarkus. In this chapter, we will cover a use case that can be used to initialize extension beans in a safe manner (compared to <<bean_init>>).
ja_jp: Quarkus に <<cdi-integration.adoc#synthetic_beans,synthetic bean>> を登録する場合、いくつかの方法があります。 この章では、エクステンション Bean を (<<bean_init>> と比較して) 安全に初期化するために使用できるユースケースを取り上げます。

source: There are several ways to register a <<cdi-reference.adoc#synthetic_beans,synthetic bean>> in Quarkus. In this chapter, we will cover a use case that can be used to initialize extension beans in a safe manner (compared to <<bean_init>>).
ja_jp: Quarkusで link:cdi-reference.html#synthetic_beans[合成Bean] を登録する方法はいくつかあります。この章では、（ link:#bean_init[[bean_init]] と比較して）安全な方法でエクステンションBeanを初期化できるユースケースを取り上げます。

source: There are several ways to solve this problem:
ja_jp: この問題を解決するには、いくつかの方法があります。
